# EventSearchBean
filterName = Identificador del panell de filtrat a utilitzar al cercador. Per defecte s'utilitzar\u00e0 'classic'
viewName = ('table','grouped','linked','schedule','list').Identificador del panell de resultats a utilitzar al cercador. Per defecte s'utilitzar\u00e0 'table'. La vista 'table' mostra els esdeveniments un per un i paginats. 'grouped' agrupats per dies. 'linked' vista un per un navegable. 'schedule' component de calendari.
templateName = Nom de la plantilla interna a aplicar per a distribuir al cercador el filtrat i els resultats. Per defecte s'aplicar\u00e0 la plantilla 'minimal', que mostra el panell de filtrat a sobre dels resultats
searchEventType = Tipus que han de tenir els esdeveniments a cercar. Si no s'indica es cercar\u00e0 pel tipus que l'usuari hagi escollit al cercador
searchEventTheme = Temes d'agenda als quals han de pert\u00e0nyer els esdeveniments a cercar. Si no s'indica es cercar\u00e0 pel tema que l'usuari hagi escollit al cercador
searchEventRoom = Propietat multivaluada que permet acotar el llistat de sales que sortir\u00e0 al desplegable de filtre per sales.
securityMode = ('hidden','filtered'). Indica com es mostraran els esdeveniments que l'usuari no pot veure. Si el valor \u00e9s 'hidden' es mostraran els esdeveniments no visibles amb interrogants. Si el valor \u00e9s 'filtered', o si no hi \u00e9s, no es mostraran
resultList.showOnFirstRequest = Indica si s'han de mostrar resultats en la primera c\u00e0rrega
orderBy = Llista de camps pels quals ordenar els resultats de la cerca. Per a cada camp es pot afegir ':desc' per indicar que s'aplicar\u00e0 ordenaci\u00f3 descendent. Si no s'especifica aquesta propietat els esdeveniments s'ordenaran ascendentment per data inicial i per data final

searchEventPropertyName = Nom de propietat din\u00e0mica per la qual filtrar la llista d'esdeveniments. Funciona amb combinaci\u00f3 amb 'searchEventPropertyValue'.
searchEventPropertyValue = Valor que ha de tenir la propietat din\u00e0mica especificada a 'searchEventPropertyName' per filtrar la llista d'esdeveniments.
attendantMode = Propietat booleana que permet escollir si nom\u00e9s es volen veure els esdeveniments on l'usuari \u00e9s assistent (valor 'true') o la vista normal segons rols d'usuari (valor 'false').
scheduleMode = ('day','week','workweek','month') Permet escollir el mode de visualitzaci\u00f3 de la vista de calendari (viewName = 'schedule'). Per defecte s'utilitzar\u00e0 'month'
header.docId = Identificador del document de cap\u00e7alera
footer.docId = Identificador del document de peu de p\u00e0gina
renderFilterPanel = Propietat booleana que indica si es mostra el panell amb les propietats de filtrat.
renderCalendarPanel = Propietat booleana que indica si es mostra el calendari de selecci\u00f3 de dia.
renderEventIdFilter = Propietat booleana que indica si es mostra el filtre per eventId. El valor per defecte \u00e9s 'true'
renderTypeFilter = Propietat booleana que indica si es mostra el filtre per tipus d'esdeveniment. El valor per defecte \u00e9s 'true'
renderContentFilter = Propietat booleana que indica si es mostra el filtre per contingut. El valor per defecte \u00e9s 'true'
renderDateFilter = Propietat booleana que indica si es mostra el filtre per dates. El valor per defecte \u00e9s 'true'
renderPersonFilter = Propietat booleana que indica si es mostra el filtre per persones. El valor per defecte \u00e9s 'true'
renderRoomFilter = Propietat booleana que indica si es mostra el filtre per sales. El valor per defecte \u00e9s 'true'
renderThemeFilter = Propietat booleana que indica si es mostra el filtre per temes. El valor per defecte \u00e9s 'true'
renderInputPropertiesFilter = Propietat booleana que indica si es mostra el filtre de tipus caixa de text per propietats din\u00e0miques. El valor per defecte \u00e9s 'true'
renderSelectPropertiesFilter = Propietat booleana que indica si es mostra el filtre de tipus desplegable per propietats din\u00e0miques. El valor per defecte \u00e9s 'true'
renderActionsBar = Propietat booleana que indica si es mostra la botonera d'accions. Nom\u00e9s v\u00e0lid per la vista de calendari. El valor per defecte \u00e9s 'true'
renderFilterInfo = Propietat booleana que indica si es mostra el panell amb informaci\u00f3 dels filtres aplicats.
renderPickButton = Propietat booleana que indica si permet fer captura d'esdeveniments.
renderPublicIcon = Propietat booleana que indica si es mostra la icona d'esdeveniment de tipus p\u00fablic o no.
runAsAdminFor = Propietat que recull la llista d'usuaris que accediran a l'agenda com administradors.
scheduleSelectMode = ('select','detail','edit') Determina l'acci\u00f3 a realitzar al seleccionar un esdeveniment: 'detail' mostra el detall d'un esdeveniment (per defecte), 'edit' mostra la fitxa d'edici\u00f3 i 'select' nom\u00e9s selecciona l'esdeveniment.
scheduleDateFormat = Format que tindran les dates dels dies a la vista schedule. El valor per defecte \u00e9s EE dd/MM/yyyy.
searchDateComparator = ('S','E','R') Determina sobre quina data de l'esdeveniment actua el filtre per dates. 'S' act\u00faa sobre la data d'inici, 'E' sobre la data de fi, i 'R' sobre el rang data inici - data fi
sortEventType = Propietat booleana que indica si el desplegable de tipus s'ha ordenar alfab\u00e8ticament i sense accents.
sortEventTheme = Propietat booleana que indica si el desplegable de temes s'ha ordenar alfab\u00e8ticament i sense accents.
searchDays = Nombre de dies m\u00e0xim que es cerca cap al passat.
showEventSecuritySource = ('event','node','node_event') Defineix d'on s'obtenen els rols per comprovar l'acc\u00e9s a la fitxa de l'esdeveniment. 'event' mostra el bot\u00f3 si es t\u00e9 els rols d'edici\u00f3 de l'esdeveniment. 'node' mostra el bot\u00f3 si es t\u00e9 els rols d'edici\u00f3 del node. 'node_event' mostra el bot\u00f3 si es t\u00e9nen rols d'edici\u00f3 de les dues fonts anteriors.
mainAgendaMid = Indica el Mid de l'agenda p\u00fablica del web. Serveix perqu\u00e8 es pugui mostrar, amb el simbol W, les tem\u00e0tiques definides a la web p\u00fablica.

#MeetingFinder
defaultRangeStartTime = Hora m\u00ednima en que es cercaran forats d'agenda en format HHmm. Per defecte 0000.
defaultRangeEndTime = Hora m\u00e0xima en que es cercaran forats d'agenda, en format HHmm. Per defecte 2359.