# EventSearchBean
filterName = Identificador del panel de filtrado a utilizar en el buscador. Por defecto se utilizar\u00e1 'classic'
viewName = ('table','grouped','linked','schedule','list'). Identificador del panel de resultados a utilizar en el buscador. Por defecto se utilizar\u00e1 'table'. La vista 'table' muestra los acontecimientos uno a uno y paginados. 'grouped' agrupados por d\u00edas. 'linked' uno a uno navegable. 'schedule' componente de calendario.
templateName = Nombre de la plantilla interna a aplicar para distribuir en el buscador el filtrado y los resultados. Por defecto se aplicar\u00e1 la plantilla 'minimal', que muestra el panel de filtrado encima de los resultados
searchEventType = Tipo que tienen que tener los eventos a buscar. Si no se indica se buscar\u00e1 por el tipo que el usuario haya escogido en el buscador
searchEventTheme = Temas de agenda a los que tienen que pertenecer los eventos a buscar. Si no se indica se buscar\u00e1 por el tema que el usuario haya escogido en el buscador
searchEventRoom = Propiedad multivaluada que permite acotar el listado de salas que aparecer\u00e1 en el desplegable de filtro por salas.
securityMode = ('hidden','filtered').Indica c\u00f3mo se mostrar\u00e1n los eventos que el usuario no puede ver. Si el valor es 'hidden' se mostrar\u00e1n los eventos no visibles con interrogantes. Si el valor \u00e9s 'filtered', o si no est\u00e1, no se mostrar\u00e1n
resultList.showOnFirstRequest = Indica si se tienen que mostrar resultados en la primera carga
orderBy = Lista de campos por los cuales ordenar los resultados de la b\u00fasqueda. Para cada campo se puede a\u00f1adir ':desc' para indicar que se aplicar\u00e1 ordenaci\u00f3n descendente. Si no se especifica esta propiedad los eventos se ordenar\u00e1n ascendentemente por fecha inicial y por fecha final

searchEventPropertyName = Nombre de la propiedad din\u00e1mica por la cual filtrar la lista de acontecimientos. Funciona en combinaci\u00f3n con 'searchEventPropertyValue'.
searchEventPropertyValue = Valor que ha de tener la propiedad din\u00e1mica especificada en 'searchEventPropertyName' para filtrar la lista de acontecimientos.
attendantMode = Propiedad booleana que permite elegir si solo se ven los acontecimientos donde el usuario es asistente (valor 'true') o la vista normal seg\u00fan roles de usuario (valor 'false').
scheduleMode = ('day','week','workweek','month') Permite elegir el modo de visualizaci\u00f3n de la vista de calendario (viewName = 'schedule'). Por defecto se utilizar\u00e1 'month'
header.docId = Identificador del documento de cabecera
footer.docId = Identificador del documento de pie de p\u00e1gina
renderFilterPanel = Propiedad booleana que indica si se muestra el panel con las propiedades de filtrado.
renderCalendarPanel = Propiedad booleana que indica si se muestra el calendario de selecci\u00f3n de dia.
renderEventIdFilter = Propiedad booleana que indica si se muestra el filtro por eventId. El valor por defecto es 'true'
renderTypeFilter = Propiedad booleana que indica si se muestra el filtro por tipo de acontecimiento. El valor por defecto es 'true'
renderContentFilter = Propiedad booleana que indica si se muestra el filtro por contenido. El valor por defecto es 'true'
renderDateFilter = Propiedad booleana que indica si se muestra el filtro por fechas. El valor por defecto es 'true'
renderPersonFilter = Propiedad booleana que indica si se muestra el filtro por personas. El valor por defecto es 'true'
renderRoomFilter = Propiedad booleana que indica si se muestra el filtro por salas. El valor por defecto es 'true'
renderThemeFilter = Propiedad booleana que indica si se muestra el filtro por temas. El valor por defecto es 'true'
renderInputPropertiesFilter = Propiedad booleana que indica si se muestra el filtro de tipo caja de texto para propiedades din\u00e1micas. El valor por defecto es 'true'
renderSelectPropertiesFilter = Propiedad booleana que indica si se muestra el filtro de tipo desplegable para propiedades din\u00e1micas. El valor por defecto es 'true'
renderActionsBar = Propiedad booleana que indica si se muestra la botonera de acciones. Solo v\u00e1lido para la vista de calendario. El valor por defecto es 'true'
renderFilterInfo = Propiedad booleana que indica si se muestra el panel con informaci\u00f3n de los filtros aplicados.
renderPickButton = Propiedad booleana que indica si se permite hacer captura de eventos.
renderPublicIcon = Propietat booleana que indica si se muestra el icono de evento de tipo p\u00fablico o no.
runAsAdminFor = Propiedad que recoge la lista de usuarios que acceder\u00e1n a la agenda como administradores.
scheduleSelectMode = ('select','detail','edit') Determina la acci\u00f3n a realizar al seleccionar un evento: 'detail' muestra el detalle del evento (por defecto), 'edit' muestra la ficha de edici\u00f3n y 'select' solo selecciona el evento (por defecto).
scheduleDateForma = Formato que tendran las fechas de los dias en la vista schedule. El valor por defecto es EE dd/MM/yyyy.
searchDateComparator = ('S','E','R') Determina sobre que fecha del evento act\u00faa el filtro por fechas. 'S' act\u00faa sobre la fecha de inicio, 'E' sobre la fecha de fin, i 'R' sobre el intervalo fecha inicio - fecha fin
sortEventType = Propiedad booleana que indica si el desplegable de tipos se ha de ordenar alfab\u00e9ticamente y sin acentos.
sortEventTheme = Propiedad booleana que indica si el desplegable de temas se ha de ordenar alfab\u00e9ticamente y sin acentos.
searchDays = N\u00famero m\u00e1ximo de dias que se busca hacia el pasado.
showEventSecuritySource = ('event','node','node_event') Define de donde se obtienen los roles para comprobar el acceso a la ficha del evento. 'event' muestra el bot\u00f3n si se tienen roles de edici\u00f3n del evento. 'node' muestra el bot\u00f3n si se tienen roles de edici\u00f3n del nodo. 'node_event' muestra el bot\u00f3n si se tienen roles de edici\u00f3n de las dos fuentes anteriores.
mainAgendaMid = Indica el Mid de la agenda p\u00fablica de la web. Sirve para que se pueda mostrar, con el s\u00edmbolo W, las tem\u00e1ticas definidas en la web p\u00fablica.
