searchCaseType = Indica el tipus d'expedient a cercar. Si no s'especifica, es podr\u00e0 escollir el tipus al fer la cerca
resultList.showOnFirstRequest = Indica si s'han de mostrar resultats en la primera c\u00e0rrega
maxPersonContacts = Nombre m\u00e0xim de contactes de la persona
maxRepresentantContacts = Nombre m\u00e0xim de contactes del representant
loadMetadata = Indica si als cases resultants de fer la cerca es carreguen les metadades pr\u00f2pies del case o no (true/false). \u00c9s fa servir si al llistat de resultats es mostra o \u00e9s necessita alguna d'aquestes propietats. L'activaci\u00f3 d'aquesta propietat incideix en el rendiment de la cerca per lo que no s'aconsella activarla si no \u00e9s estrictament necessari.

#CaseTreeBean

rootCaseId = Indica l'identificador de l'expedient a mostrar a l'arrel de l'arbre. Aquesta propietat \u00e9s obligat\u00f2ria.
relationName = Propietat multivaluada que indica els noms dels tipus de relaci\u00f3 entre expedients mitjan\u00e7ant els quals es construir\u00e0 l'arbre. Aquesta propietat \u00e9s obligat\u00f2ria.
relationDirection = Propietat multivaluada que indica la direcci\u00f3 (direct/reverse) de cadascun dels tipus de relaci\u00f3 indicats a la propietat 'relationName'. Aquesta propietat \u00e9s obligat\u00f2ria.
relationIcon = Propietat multivaluada que indica la icona a mostrar per a cadascun dels tipus de relaci\u00f3 indicats a la propietat 'relationName'. Aquesta propietat \u00e9s opcional.
rootIcon = Propietat multivaluada que indica la icona a mostrar per al node arrel de l'arbre. Aquesta propietat \u00e9s opcional.
searchHelp.leafType = Propietat multivaluada que indica els tipus d'expedient que s\u00f3n fulla a l'arbre. Aquesta propietat \u00e9s opcional i ajuda a augmentar el rendiment de l'arbre.
searchHelp.caseType = Propietat multivaluada que indica els tipus d'expedient que es mostraran a l'arbre. Aquesta propietat \u00e9s opcional i ajuda a augmentar el rendiment de l'arbre.
searchHelp.maxCases = Indica el nombre m\u00e0xim d'expedients a utilitzar com a base per a la cerca d'expedients a l'arbre. Un nombre baix far\u00e0 m\u00e9s r\u00e0pida la cerca, per\u00f2 disminuir\u00e0 la possibilitat d'\u00e8xit. Un nombre gran tindr\u00e0 l'efecte contrari. Per defecte: 100.
renderedProperties.caseType = Propietat multivaluada que indica els tipus d'expedient dels quals es volen mostrar propietats. Aquesta propietat \u00e9s opcional.
renderedProperties.propertyName = Propietat multivaluada que indica la propietat o propietats (separades per comes) que es volen mostrar per cadascun dels tipus indicats a la propietat 'renderedProperties.caseType', en el mateix ordre. Aquesta propietat \u00e9s obligat\u00f2ria si s'ha especificat la propietat 'renderedProperties.caseType', i ha de tenir el mateix nombre de valors.
renderedProperties.layout = Propietat multivaluada que indica com es volen pintar a l'arbre les propietats per cadascun dels tipus indicats a la propietat 'renderedProperties.caseType', en el mateix ordre. Pot tenir com a valors 'text' (les propietats es pinten a la dreta del node), 'list' (les propietats es mostren a sota del node, com a llista) o 'popup' (les propietats es mostren com a pop-up a sobre del node). Aquesta propietat \u00e9s obligat\u00f2ria si s'ha especificat la propietat 'renderedProperties.caseType', i ha de tenir el mateix nombre de valors.