searchCaseType = Indica el tipo de expediente a buscar. Si no se especifica, se podr\u00e1 escoger el tipo al hacer la b\u00fasqueda
resultList.showOnFirstRequest = Indica si se tienen que mostrar resultados en la primera carga
maxPersonContacts = N\u00famero m\u00e1ximo de contactos de la persona
maxRepresentantContacts = N\u00famero m\u00e1ximo de contactos del representante
loadMetadata = Indica si en los cases resultantes de hacer la b\u00fasqueda se cargan los metadatos propios del case o no (true/false). Se usa si en el listado de resultados se muestra o se necesita alguna de estas propiedades. La activaci\u00f3n de esta propiedad incide en el rendimento general de la b\u00fasqueda por lo que no se aconseja activarla si no es estrictamente necesario.

#CaseTreeBean

rootCaseId = Indica el identificador del expediente a mostrar en la ra\u00edz del \u00e1rbol. Esta propiedad es obligatoria.
relationName = Propiedad multivaluada que indica los nombres de los tipos de relaci\u00f3n entre expedientes mediante los cuales se construir\u00e1 el \u00e1rbol. Esta propiedad es obligatoria.
relationDirection = Propiedad multivaluada que indica la direcci\u00f3n (direct/reverse) de cada uno de los tipos de relaci\u00f3n indicados en la propiedad 'relationName'. Esta propiedad es obligatoria.
relationIcon = Propiedad multivaluada que indica el icono a mostrar para cada uno de los tipos de relaci\u00f3n indicados en la propiedad 'relationName'. Esta propiedad es opcional.
rootIcon = Propiedad multivaluada que indica el icono a mostrar para el nodo ra\u00edz del \u00e1rbol. Esta propiedad es opcional.
searchHelp.leafType = Propiedad multivaluada que indica los tipos de expediente que s\u00f3n hoja en el \u00e1rbol. Esta propiedad es opcional y ayuda a aumentar el rendimiento del \u00e1rbol.
searchHelp.caseType = Propiedad multivaluada que indica los tipos de expediente que se mostrar\u00e1n en el \u00e1rbol. Esta propiedad es opcional y ayuda a aumentar el rendimiento del \u00e1rbol.
searchHelp.maxCases = Indica el n\u00famero m\u00e1ximo de expedientes a utilizar como base para la b\u00fasqueda de expedientes en el \u00e1rbol. Un n\u00famero bajo har\u00e1 m\u00e1s r\u00e1pida la b\u00fasqueda, pero disminuir\u00e1 la posibilidad de \u00e9xito. Un n\u00famero alto tendr\u00e1 el efecto contrario. Por defecto: 100.
renderedProperties.caseType = Propiedad multivaluada que indica los tipos de expediente de los cuales se quieren mostrar propiedades. Esta propiedad es opcional.
renderedProperties.propertyName = Propiedad multivaluada que indica la propiedad o propiedades (separadas por comas) que se quieren mostrar para cada uno de los tipos indicados en la propiedad 'renderedProperties.caseType', en el mismo orden. Esta propiedad es obligatoria si se ha especificado la propiedad 'renderedProperties.caseType', y tiene que tener el mismo n\u00famero de valores.
renderedProperties.layout = Propiedad multivaluada que indica como se quieren pintar en el \u00e1rbol las propiedades para cada uno de los tipos indicados en la propiedad 'renderedProperties.caseType', en el mismo orden. Puede tener como valores 'text' (las propiedades se pintan a la derecha del nodo), 'list' (las propiedades se muestran debajo del nodo, como lista) o 'popup' (las propiedades se muestran como pop-up encima del nodo).  Esta propiedad es obligatoria si se ha especificado la propiedad 'renderedProperties.caseType', y tiene que tener el mismo n\u00famero de valores.
